#-*- encoding: utf-8 -*-

ResultInfo = {
    0 : 'OK',

    101 : '数据库操作失败',
    
    1001 : '参数缺少或错误',

    1002 : '该对象不存在',
    1003 : '该对象已存在',
    1004 : '无权限执行该操作',


    100001 : '用户名或密码不能为空',
    100002 : '用户名或密码错误，登录失败',
    100003 : '用户首次登录请修改密码',
    
    
    101001 : '应用名称已存在',
    101002 : '该应用不存在',
    101003 : '应用功能还未添加',
    101004 : '暂无可用应用，请先创建',
    101005 : '应用编号已存在',
    101006 : '应用编号只允许输入英文字母、数字和下划线',


    102001 : '功能用户自定义权限json不符合规范，格式为：[{"k":"a1","v":"功能1"},{"k":"b1","v":"功能2"}],"k"只允许输入英文字母、数字、下划线和小数点',
    102002 : '该功能不存在',
    102003 : '该PATH功能已存在',
    

    103001 : '用户Email已存在',
    103002 : '该用户不存在',
    103003 : '角色绑定用户需先创建用户',
    103004 : '用户绑定角色失败，请选择角色',
    103005 : '用户绑定角色失败',
    103006 : '该用户绑定的角色不存在',
    103007 : '请先选择用户',
    103008 : '该用户名已存在',
    103009 : '原始密码错误',
    103010 : '两次新密码输入不同',
    103011 : '原始密码与新密码相同',
    103012 : '密码需要至少8位，并且包含字母和数字',

    
    104001 : '角色名称已存在',
    104002 : '该角色不存在',
    104003 : '编辑权限需先添加角色和应用',
    104004 : '保存权限信息失败，请重试，谢谢。',
    

    105001 : '用户组名称已存在',
    105002 : '该用户组不存在',
    105003 : '该用户组绑定用户需先创建用户组',
    105004 : '用户组绑定用户失败，请选择用户',
    105005 : '用户组绑定用户失败',
    105006 : '该用户组绑定的用户不存在',
    105007 : '用户组绑定角色失败，请选择角色',
    105008 : '用户组绑定角色失败',
    105009 : '该用户组绑定的角色不存在',
    105010 : '请先选择用户组',

    999999 : '未知错误',
}

Boole = {
    'true' : 1,
    'false' : 2,
}

User = {
    'normal' : 1,
    'leave' : 10,
}


Status = {
    1 : '可用',
    2 : '不可用',
}
UserStatus = {
    1 : '在职',
    2 : '离职',
}


statusActive = 1


operView = 1
operAdd = 2
operEdit = 4
operDel = 8

